"""1. Создать класс TrafficLight (светофор) и определить у него один
атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный.
В рамках метода реализовать переключение светофора в режимы:
красный, желтый, зеленый. Продолжительность первого состояния (красный)
 составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) —
 на ваше усмотрение. Переключение между
 режимами должно осуществляться только в указанном порядке
 (красный, желтый, зеленый).
Проверить работу примера, создав экземпляр и вызвав описанный метод."""

import time


class TrafficLight:
    __color = [['красный', 7], ["желтый", 2], ["зеленый", 5]]

    def running(self):
        for i in range(3):
            print(self.__color[i][0])
            time.sleep(self.__color[i][1])


test = TrafficLight()
test.running()
